[
  {
    "title": "Practical Risk Management for Entrepreneurs",
    "content": "# Practical Risk Management for Entrepreneurs\n\n## Introduction\n\n*Have you ever wondered how businesses operated before the advent of formal risk management practices and the widespread adoption of corporate frameworks like COSO ERM or ISO 31000?*\n\nManufacturing produced goods, banks provided services, and businesses functioned without structured risk management frameworks. While I respect the expertise of the authors behind these standards, attempting to sell risk management concepts as presented in these frameworks (e.g., risk appetite, risk maps, risk registers, and action plans) to business owners often results in resistance and rejection.\n\n> This guide aims to translate the essence of risk management into a language that resonates with both entrepreneurs and risk practitioners.\n\nFor the sake of simplicity and to avoid legal complexities, the following is axiom:\n\n* **Entrepreneur** - the person acting as founders, shareholders, or business owner.\n* **Business** - is a series of time-bound actions and resource-constrained efforts focused on generating wealth and creating value.\n\n## What Is Business About?\n\nRunning a business is fundamentally about **generating profit** and increasing the wealth of entrepreneur. An entrepreneur might aim to invest $8,000 into a business and generate $20,000 within two months. This objective aligns with the S.M.A.R.T. framework and highlights three key components:\n\n1. **Knowing the reward**: The expected financial return.\n2. **Understanding cost**: The amount of money an entrepreneur is willing to invest to achieve the goal.\n3. **Defining timing**: The timeframe within which the objective must be achieved.\n\n*The same principle applies to non-profit organisations, with the difference that profits are not retained by the entrepreneur but are instead reinvested into operations or allocated to supporting third parties.*\n\n## Business Model\n\nIn the pursuit of profit, entrepreneurs have the freedom to choose their path—whether to forge their own unique way or follow established models. However, the journey is rarely straightforward; otherwise, everyone would be a millionaire. Three critical factors shape this journey:\n\n### Critical Factors\n\n1. **Constraints**: These may be mandatory (e.g., legal or industry regulations) or personal (e.g., moral values or beliefs, including statements given on free will).\n\n2. **Dynamic Environment**: External conditions are rarely stable. Boundaries shift, resources become scarce, and entrepreneurs must adapt to changes. This requires dealing with uncertainty - whether they involve people, events, actions (or inactions), timing, or technology—that could hinder goal achievement.\n\n3. **Iterative Progress**: Success seldom comes in one giant leap. Instead, it involves a series of iterations, each yielding incremental gains (e.g., a 4% profit increase per cycle).\n\n## Reality versus Business Model\n\nEstablishing a successful business model means finding an approach that consistently delivers results. If a strategy has been executed multiple times and continues to achieve its objectives, it can be considered effective. However, even a once-thriving business is not immune to failure.\n\n### The Hard Truth About Business Survival\n\n* **20%** of businesses fail within the first year.\n* **45%** of businesses fail within five years.\n\nWhile the exact numbers may vary, the underlying reason remains the same—**uncertainty**. Business failures are not simply due to good or bad circumstances but rather how entrepreneurs respond to uncertainty.\n\n## Understanding Uncertainty in Business\n\nFrom a business perspective, uncertainty presents itself in two ways:\n\n### Opportunity\n\nA change in the operating environment that has been identified and aligned with the current business model, requiring little or no adjustment to capitalise on it.\n\n### Risk\n\nA change that the business cannot handle within its existing business model, necessitating adjustments in operations, processes, personnel, or technology to stay on course.\n\n## The Connection Between Opportunities and Business Model\n\nOpportunities in business are not universal—they depend on the environment in which a business operates. A business model defines what is possible and what falls outside its scope.\n\n### Case Study: The Street-Food Entrepreneur\n\nConsider an entrepreneur who starts a street-food business in Thailand. How likely is it that they can profit from fluctuations in the U.S. stock market? Almost zero. The stock market is entirely unrelated to their business model, making such an opportunity irrelevant.\n\nNow, what if the entrepreneur wants their street-food business to grow faster than the current model allows? One possibility is getting recognised by Michelin, which could bring international fame. But can they directly make this happen? Not unless they know exactly how to find a Michelin inspector and convince them to visit.\n\nA far more practical opportunity for the entrepreneur might be improving efficiency. Suppose they realise that their oven consumes too much electricity and bakes only five sets of hotpots at a time. If they find an oven that uses 30% less electricity while producing eight sets, and it's available at an affordable price, that's an opportunity they can act on.\n\n### Key Principles\n\n* Opportunities must align with the existing business environment to be viable.\n* Growth beyond the current model often requires access to new networks, resources, or knowledge.\n\n> Simply put, an opportunity is only useful if the business can realistically pursue it—or if the business model can be adapted to capture it.\n\n## The Connection Between Risk and Business Model\n\n### The Kodak Case Study\n\nKodak's strong belief that paper photographs would always be in demand was a significant factor in its business model. Kodak's model was built around film production, processing, and physical photography products. Despite the invention of the digital camera in 1975 by Steven Sasson, Kodak's leadership did not recognise the risk over decades posed by the new technology.\n\nUltimately, Kodak's failure to integrate the new digital camera technology into its business model and recognise the risk of disruptive innovation contributed to its downfall. A company's ability to acknowledge such risks and adapt its business model is crucial for long-term survival and competitiveness in a rapidly changing market.\n\n## What Defines an Effective Business Model?\n\nAn effective business model is characterised by:\n\n1. **Cost Efficiency**: Sourcing the cheapest components or resources.\n2. **Value Creation**: Assembling these components in a way that maximises value for customers and allows for the highest possible selling price.\n3. **Ability to continuously adapt**: Innovation in entrepreneurship rarely involves creating something entirely new. More often, it's about optimising existing products or services to make them better or more cost-effective.\n\nBy focusing on these principles, entrepreneurs can navigate the complexities of business and achieve sustainable growth.\n\n## Beyond Documentation\n\nIs a business model just a document outlining key principles? The simplest answer is no. The business model shall draw your cashflow and answer the following questions:\n\n* How much money will the business have in a particular moment in a future?\n* Will the business generate profit or will it incur a loss?\n* What changes should be made to increase profit or shorten the payback period?\n\n> As business grows, the naming might change (business plan, business model, budget, strategy), however the meaning is always the same."
  },
  {
    "title": "2nd post",
    "content": " Lorum ipsum dolorum"
  }
]
